Revit 2027 API
Transform2D.CreateIdentity Method
 Creates the identity transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Transform2D CreateIdentity()
Public Shared Function CreateIdentity As Transform2D
public:
static Transform2D^ CreateIdentity()
static member CreateIdentity : unit -> Transform2D
Return Value
Transform2D
 The identity transformation.
Remarks
 The identity transformation does not change a point or a vector that it is applied to.
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace